MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM344FDXBG/mcu.h
/**
 *******************************************************************************
 * @file    TMPM344.h
 * @brief   CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM344' Device Series
 * @version V2.0.2.7 (Tentative)
 * @date    2018/03/30
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA MICROELECTRONICS CORPORATION 2018 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TX03_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM344
  * @{
  */

#ifndef __TMPM344_H__
#define __TMPM344_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M3 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M3 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M3 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M3 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M3 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M3 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M3 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M3 System Tick Interrupt                          */

/******  TMPM344 Specific Interrupt Numbers *******************************************************************/
  INT0_IRQn                     = 0,         /*!< Interrupt pin 0                                             */
  INT1_IRQn                     = 1,         /*!< Interrupt pin 1                                             */
  INT2_IRQn                     = 2,         /*!< Interrupt pin 2                                             */
  INT3_IRQn                     = 3,         /*!< Interrupt pin 3                                             */
  INT4_IRQn                     = 4,         /*!< Interrupt pin 4                                             */
  INT5_IRQn                     = 5,         /*!< Interrupt pin 5                                             */
  INT6_IRQn                     = 6,         /*!< Interrupt pin 6                                             */
  INT7_IRQn                     = 7,         /*!< Interrupt pin 7                                             */
  INT8_IRQn                     = 8,         /*!< Interrupt pin 8                                             */
  INT9_IRQn                     = 9,         /*!< Interrupt pin 9                                             */
  INTA_IRQn                     = 10,        /*!< Interrupt pin A                                             */
  INTB_IRQn                     = 11,        /*!< Interrupt pin B                                             */
  INTC_IRQn                     = 12,        /*!< Interrupt pin C                                             */
  INTD_IRQn                     = 13,        /*!< Interrupt pin D                                             */
  INTE_IRQn                     = 14,        /*!< Interrupt pin E                                             */
  INTF_IRQn                     = 15,        /*!< Interrupt pin F                                             */
  INTPSCASTOP_IRQn              = 16,        /*!< PSC end interrupt (unitA)                                   */
  INTPSCABRK_IRQn               = 17,        /*!< PSC break interrupt (unitA)                                 */
  INTPSCASTEP_IRQn              = 18,        /*!< PSC step interrupt (unitA)                                  */
  INTPSCAII_IRQn                = 19,        /*!< PSC unjustified instruction interrupt (unitA)               */
  INTPSCAIA_IRQn                = 20,        /*!< PSC unjustified address interrupt (unitA)                   */
  INTPSCBSTOP_IRQn              = 21,        /*!< PSC end interrupt (unitB)                                   */
  INTPSCBBRK_IRQn               = 22,        /*!< PSC break interrupt (unitB)                                 */
  INTPSCBSTEP_IRQn              = 23,        /*!< PSC step interrupt (unitB)                                  */
  INTPSCBII_IRQn                = 24,        /*!< PSC unjustified instruction interrupt (unitB)               */
  INTPSCBIA_IRQn                = 25,        /*!< PSC unjustified address interrupt (unitB)                   */
  INTPSCCSTOP_IRQn              = 26,        /*!< PSC end interrupt (unitC)                                   */
  INTPSCCBRK_IRQn               = 27,        /*!< PSC break interrupt (unitC)                                 */
  INTPSCCSTEP_IRQn              = 28,        /*!< PSC step interrupt (unitC)                                  */
  INTPSCCII_IRQn                = 29,        /*!< PSC unjustified instruction interrupt (unitC)               */
  INTPSCCIA_IRQn                = 30,        /*!< PSC unjustified address interrupt (unitC)                   */
  INTPSCDSTOP_IRQn              = 31,        /*!< PSC end interrupt (unitD)                                   */
  INTPSCDBRK_IRQn               = 32,        /*!< PSC break interrupt (unitD)                                 */
  INTPSCDSTEP_IRQn              = 33,        /*!< PSC step interrupt (unitD)                                  */
  INTPSCDII_IRQn                = 34,        /*!< PSC unjustified instruction interrupt (unitD)               */
  INTPSCDIA_IRQn                = 35,        /*!< PSC unjustified address interrupt (unitD)                   */
  INTT0RX_IRQn                  = 36,        /*!< TSPI0 reception interrupt                                   */
  INTT0TX_IRQn                  = 37,        /*!< TSPI0 transmission interrupt                                */
  INTT0ERR_IRQn                 = 38,        /*!< TSPI0 error interrupt                                       */
  INTT1RX_IRQn                  = 39,        /*!< TSPI1 reception interrupt                                   */
  INTT1TX_IRQn                  = 40,        /*!< TSPI1 transmission interrupt                                */
  INTT1ERR_IRQn                 = 41,        /*!< TSPI1 error interrupt                                       */
  INTT2RX_IRQn                  = 42,        /*!< TSPI2 reception interrupt                                   */
  INTT2TX_IRQn                  = 43,        /*!< TSPI2 transmission interrupt                                */
  INTT2ERR_IRQn                 = 44,        /*!< TSPI2 error interrupt                                       */
  INTT3RX_IRQn                  = 45,        /*!< TSPI3 reception interrupt                                   */
  INTT3TX_IRQn                  = 46,        /*!< TSPI3 transmission interrupt                                */
  INTT3ERR_IRQn                 = 47,        /*!< TSPI3 error interrupt                                       */
  INTT4RX_IRQn                  = 48,        /*!< TSPI4 reception interrupt                                   */
  INTT4TX_IRQn                  = 49,        /*!< TSPI4 transmission interrupt                                */
  INTT4ERR_IRQn                 = 50,        /*!< TSPI4 error interrupt                                       */
  INTUART0_IRQn                 = 51,        /*!< Full UART0 transmission and reception interrupt             */
  INTRX0_IRQn                   = 52,        /*!< Serial0 reception interrupt                                 */
  INTTX0_IRQn                   = 53,        /*!< Serial0 transmission interrupt                              */
  INTI2C_IRQn                   = 54,        /*!< I2C interrupt                                               */
  INTADA_IRQn                   = 55,        /*!< AD conversion interrupt (unitA)                             */
  INTADB_IRQn                   = 56,        /*!< AD conversion interrupt (unitB)                             */
  INTADC_IRQn                   = 57,        /*!< AD conversion interrupt (unitC)                             */
  INTADAHP_IRQn                 = 58,        /*!< High Priority AD conversion interrupt (unitA)               */
  INTADBHP_IRQn                 = 59,        /*!< High Priority AD conversion interrupt (unitB)               */
  INTADCHP_IRQn                 = 60,        /*!< High Priority AD conversion interrupt (unitC)               */
  INTEPHC0_IRQn                 = 61,        /*!< Two-phase pulse input counter 0 interrupt                   */
  INTPHCP0OVF_IRQn              = 62,        /*!< EPHC0 overflow interrupt                                    */
  INTPHCP0PHE_IRQn              = 63,        /*!< EPHC0 phase error interrupt                                 */
  INTPHCP0CY0_IRQn              = 64,        /*!< EPHC0 cycle interrupt 0                                     */
  INTPHCP0CY1_IRQn              = 65,        /*!< EPHC0 cycle interrupt 1                                     */
  INTPHCP0CY2_IRQn              = 66,        /*!< EPHC0 cycle interrupt 2                                     */
  INTPHCP0CY3_IRQn              = 67,        /*!< EPHC0 cycle interrupt 3                                     */
  INTPHCP0LMT_IRQn              = 68,        /*!< EPHC0 cycle outrange interrupt                              */
  INTEPHC1_IRQn                 = 69,        /*!< Two-phase pulse input counter 1 interrupt                   */
  INTPHCP1OVF_IRQn              = 70,        /*!< EPHC1 overflow interrupt                                    */
  INTPHCP1PHE_IRQn              = 71,        /*!< EPHC1 phase error interrupt                                 */
  INTPHCP1CY0_IRQn              = 72,        /*!< EPHC1 cycle interrupt 0                                     */
  INTPHCP1CY1_IRQn              = 73,        /*!< EPHC1 cycle interrupt 1                                     */
  INTPHCP1CY2_IRQn              = 74,        /*!< EPHC1 cycle interrupt 2                                     */
  INTPHCP1CY3_IRQn              = 75,        /*!< EPHC1 cycle interrupt 3                                     */
  INTPHCP1LMT_IRQn              = 76,        /*!< EPHC1 cycle outrange interrupt                              */
  INTEPHC2_IRQn                 = 77,        /*!< Two-phase pulse input counter 2 interrupt                   */
  INTPHCP2OVF_IRQn              = 78,        /*!< EPHC2 overflow interrupt                                    */
  INTPHCP2PHE_IRQn              = 79,        /*!< EPHC2 phase error interrupt                                 */
  INTPHCP2CY0_IRQn              = 80,        /*!< EPHC2 cycle interrupt 0                                     */
  INTPHCP2CY1_IRQn              = 81,        /*!< EPHC2 cycle interrupt 1                                     */
  INTPHCP2CY2_IRQn              = 82,        /*!< EPHC2 cycle interrupt 2                                     */
  INTPHCP2CY3_IRQn              = 83,        /*!< EPHC2 cycle interrupt 3                                     */
  INTPHCP2LMT_IRQn              = 84,        /*!< EPHC2 cycle outrange interrupt                              */
  INTTDA0CMP0_IRQn              = 85,        /*!< TMRD0 compare match detection interrupt 0 (blockA)          */
  INTTDA0CMP1_IRQn              = 86,        /*!< TMRD0 compare match detection interrupt 1 (blockA)          */
  INTTDA0CMP2_IRQn              = 87,        /*!< TMRD0 compare match detection interrupt 2 (blockA)          */
  INTTDA0CMP3_IRQn              = 88,        /*!< TMRD0 compare match detection interrupt 3 (blockA)          */
  INTTDA0CMP4_IRQn              = 89,        /*!< TMRD0 compare match detection interrupt 4 (blockA)          */
  INTTDA1CMP0_IRQn              = 90,        /*!< TMRD1 compare match detection interrupt 0 (blockA)          */
  INTTDA1CMP1_IRQn              = 91,        /*!< TMRD1 compare match detection interrupt 1 (blockA)          */
  INTTDA1CMP2_IRQn              = 92,        /*!< TMRD1 compare match detection interrupt 2 (blockA)          */
  INTTDA1CMP3_IRQn              = 93,        /*!< TMRD1 compare match detection interrupt 3 (blockA)          */
  INTTDA1CMP4_IRQn              = 94,        /*!< TMRD1 compare match detection interrupt 4 (blockA)          */
  INTTDB0CMP0_IRQn              = 95,        /*!< TMRD0 compare match detection interrupt 0 (blockB)          */
  INTTDB0CMP1_IRQn              = 96,        /*!< TMRD0 compare match detection interrupt 1 (blockB)          */
  INTTDB0CMP2_IRQn              = 97,        /*!< TMRD0 compare match detection interrupt 2 (blockB)          */
  INTTDB0CMP3_IRQn              = 98,        /*!< TMRD0 compare match detection interrupt 3 (blockB)          */
  INTTDB0CMP4_IRQn              = 99,        /*!< TMRD0 compare match detection interrupt 4 (blockB)          */
  INTTDB1CMP0_IRQn              = 100,       /*!< TMRD1 compare match detection interrupt 0 (blockB)          */
  INTTDB1CMP1_IRQn              = 101,       /*!< TMRD1 compare match detection interrupt 1 (blockB)          */
  INTTDB1CMP2_IRQn              = 102,       /*!< TMRD1 compare match detection interrupt 2 (blockB)          */
  INTTDB1CMP3_IRQn              = 103,       /*!< TMRD1 compare match detection interrupt 3 (blockB)          */
  INTTDB1CMP4_IRQn              = 104,       /*!< TMRD1 compare match detection interrupt 4 (blockB)          */
  INTTB0_IRQn                   = 105,       /*!< TMRB0 compare match detection interrupt                     */
  INTTB1_IRQn                   = 106,       /*!< TMRB1 compare match detection interrupt                     */
  INTTB2_IRQn                   = 107,       /*!< TMRB2 compare match detection interrupt                     */
  INTTB3_IRQn                   = 108,       /*!< TMRB3 compare match detection interrupt                     */
  INTTB4_IRQn                   = 109,       /*!< TMRB4 compare match detection interrupt                     */
  INTTB5_IRQn                   = 110,       /*!< TMRB5 compare match detection interrupt                     */
  INTTB6_IRQn                   = 111,       /*!< TMRB6 compare match detection interrupt                     */
  INTTB7_IRQn                   = 112,       /*!< TMRB7 compare match detection interrupt                     */
  INTTB8_IRQn                   = 113,       /*!< TMRB8 compare match detection interrupt                     */
  INTTB9_IRQn                   = 114,       /*!< TMRB9 compare match detection interrupt                     */
  INTTBA_IRQn                   = 115,       /*!< TMRBA compare match detection interrupt                     */
  INTTBB_IRQn                   = 116,       /*!< TMRBB compare match detection interrupt                     */
  INTTBC_IRQn                   = 117,       /*!< TMRBC compare match detection interrupt                     */
  INTTBD_IRQn                   = 118,       /*!< TMRBD compare match detection interrupt                     */
  INTTBE_IRQn                   = 119,       /*!< TMRBE compare match detection interrupt                     */
  INTTBF_IRQn                   = 120,       /*!< TMRBF compare match detection interrupt                     */
  INTTBCCAP0_IRQn               = 121,       /*!< TMRBC input capture 0 detection interrupt                   */
  INTTBCCAP1_IRQn               = 122,       /*!< TMRBC input capture 1 detection interrupt                   */
  INTTBDCAP0_IRQn               = 123,       /*!< TMRBD input capture 0 detection interrupt                   */
  INTTBDCAP1_IRQn               = 124,       /*!< TMRBD input capture 1 detection interrupt                   */
  INTTBECAP0_IRQn               = 125,       /*!< TMRBE input capture 0 detection interrupt                   */
  INTTBECAP1_IRQn               = 126,       /*!< TMRBE input capture 1 detection interrupt                   */
  INTTBFCAP0_IRQn               = 127,       /*!< TMRBF input capture 0 detection interrupt                   */
  INTTBFCAP1_IRQn               = 128,       /*!< TMRBF input capture 1 detection interrupt                   */
  INTADAM0_IRQn                 = 129,       /*!< SAR ADC monitor 0 interrupt (unitA)                         */
  INTADAM1_IRQn                 = 130,       /*!< SAR ADC monitor 1 interrupt (unitA)                         */
  INTADBM0_IRQn                 = 131,       /*!< SAR ADC monitor 0 interrupt (unitB)                         */
  INTADBM1_IRQn                 = 132,       /*!< SAR ADC monitor 1 interrupt (unitB)                         */
  INTADCM0_IRQn                 = 133,       /*!< SAR ADC monitor 0 interrupt (unitC)                         */
  INTADCM1_IRQn                 = 134,       /*!< SAR ADC monitor 1 interrupt (unitC)                         */
  INTDMACATC_IRQn               = 135,       /*!< DMA terminal count status interrupt (unitA)                 */
  INTDMACAERR_IRQn              = 136,       /*!< DMA error status interrupt (unitA)                          */
  INTDMACBTC_IRQn               = 137,       /*!< DMA terminal count status interrupt (unitB)                 */
  INTDMACBERR_IRQn              = 138,       /*!< DMA error status interrupt (unitB)                          */
  INTDMACCTC_IRQn               = 139,       /*!< DMA terminal count status interrupt (unitC)                 */
  INTDMACCERR_IRQn              = 140        /*!< DMA error status interrupt (unitC)                          */
} IRQn_Type;

