MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM344FDXBG/mcu.h
/* 12bit A/D Converter */
#define TSB_ADA_MOD0_ADS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD0,0)))
#define TSB_ADA_MOD0_HPADS                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD0,1)))
#define TSB_ADA_MOD1_ADHWE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,0)))
#define TSB_ADA_MOD1_HPADHWE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,2)))
#define TSB_ADA_MOD1_RCUT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,5)))
#define TSB_ADA_MOD1_I2AD                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,6)))
#define TSB_ADA_MOD1_DACON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD1,7)))
#define TSB_ADA_MOD3_SCAN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD3,0)))
#define TSB_ADA_MOD3_REPEAT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD3,1)))
#define TSB_ADA_MOD3_AUTO                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD3,2)))
#define TSB_ADA_MOD5_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD5,0)))
#define TSB_ADA_MOD5_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD5,1)))
#define TSB_ADA_MOD5_HPADBF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD5,2)))
#define TSB_ADA_MOD5_HPEOCF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADA->MOD5,3)))
#define TSB_ADA_MOD7_INTADDMA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD7,0)))
#define TSB_ADA_MOD7_INTADHPDMA                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->MOD7,1)))
#define TSB_ADA_CMPCR0_ADBIG0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR0,4)))
#define TSB_ADA_CMPCR0_CMPCOND0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR0,5)))
#define TSB_ADA_CMPCR0_CMP0EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR0,7)))
#define TSB_ADA_CMPCR1_ADBIG1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR1,4)))
#define TSB_ADA_CMPCR1_CMPCOND1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR1,5)))
#define TSB_ADA_CMPCR1_CMP1EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADA->CMPCR1,7)))

#define TSB_ADB_MOD0_ADS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD0,0)))
#define TSB_ADB_MOD0_HPADS                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD0,1)))
#define TSB_ADB_MOD1_ADHWE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,0)))
#define TSB_ADB_MOD1_HPADHWE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,2)))
#define TSB_ADB_MOD1_RCUT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,5)))
#define TSB_ADB_MOD1_I2AD                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,6)))
#define TSB_ADB_MOD1_DACON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD1,7)))
#define TSB_ADB_MOD3_SCAN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD3,0)))
#define TSB_ADB_MOD3_REPEAT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD3,1)))
#define TSB_ADB_MOD3_AUTO                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD3,2)))
#define TSB_ADB_MOD5_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD5,0)))
#define TSB_ADB_MOD5_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD5,1)))
#define TSB_ADB_MOD5_HPADBF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD5,2)))
#define TSB_ADB_MOD5_HPEOCF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADB->MOD5,3)))
#define TSB_ADB_MOD7_INTADDMA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD7,0)))
#define TSB_ADB_MOD7_INTADHPDMA                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->MOD7,1)))
#define TSB_ADB_CMPCR0_ADBIG0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR0,4)))
#define TSB_ADB_CMPCR0_CMPCOND0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR0,5)))
#define TSB_ADB_CMPCR0_CMP0EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR0,7)))
#define TSB_ADB_CMPCR1_ADBIG1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR1,4)))
#define TSB_ADB_CMPCR1_CMPCOND1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR1,5)))
#define TSB_ADB_CMPCR1_CMP1EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADB->CMPCR1,7)))

#define TSB_ADC_MOD0_ADS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADC->MOD0,0)))
#define TSB_ADC_MOD0_HPADS                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADC->MOD0,1)))
#define TSB_ADC_MOD1_ADHWE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD1,0)))
#define TSB_ADC_MOD1_HPADHWE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD1,2)))
#define TSB_ADC_MOD1_RCUT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD1,5)))
#define TSB_ADC_MOD1_I2AD                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD1,6)))
#define TSB_ADC_MOD1_DACON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD1,7)))
#define TSB_ADC_MOD3_SCAN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD3,0)))
#define TSB_ADC_MOD3_REPEAT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD3,1)))
#define TSB_ADC_MOD3_AUTO                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD3,2)))
#define TSB_ADC_MOD5_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->MOD5,0)))
#define TSB_ADC_MOD5_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->MOD5,1)))
#define TSB_ADC_MOD5_HPADBF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->MOD5,2)))
#define TSB_ADC_MOD5_HPEOCF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->MOD5,3)))
#define TSB_ADC_MOD7_INTADDMA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD7,0)))
#define TSB_ADC_MOD7_INTADHPDMA                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD7,1)))
#define TSB_ADC_CMPCR0_ADBIG0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR0,4)))
#define TSB_ADC_CMPCR0_CMPCOND0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR0,5)))
#define TSB_ADC_CMPCR0_CMP0EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR0,7)))
#define TSB_ADC_CMPCR1_ADBIG1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR1,4)))
#define TSB_ADC_CMPCR1_CMPCOND1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR1,5)))
#define TSB_ADC_CMPCR1_CMP1EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR1,7)))


/* Enhannced two aspect pulse input counter (EPHC) */
#define TSB_EPHC0_EN_EN                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->EN,0)))
#define TSB_EPHC0_CNT_PBMOD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,10)))
#define TSB_EPHC0_CNT_PBDIR                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,11)))
#define TSB_EPHC0_CNT_MA12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,12)))
#define TSB_EPHC0_CNT_MA2DIR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,13)))
#define TSB_EPHC0_CNT_LWLMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,18)))
#define TSB_EPHC0_CNT_UPLMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,19)))
#define TSB_EPHC0_CNT_LOADLMT                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_EPHC0->CNT,20)))
#define TSB_EPHC0_IE_INTPCCP0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,0)))
#define TSB_EPHC0_IE_INTPCCP1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,1)))
#define TSB_EPHC0_IE_INTPCOVF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,2)))
#define TSB_EPHC0_IE_INTPCUDF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,3)))
#define TSB_EPHC0_IE_INTPCDT0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,4)))
#define TSB_EPHC0_IE_INTPCDT1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,5)))
#define TSB_EPHC0_IE_INTPCDT2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,6)))
#define TSB_EPHC0_IE_INTPCDT3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,7)))
#define TSB_EPHC0_IE_INTPCDIR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,8)))
#define TSB_EPHC0_IE_INTPCUOVF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,9)))
#define TSB_EPHC0_IE_INTLWLMT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,10)))
#define TSB_EPHC0_IE_INTUPLMT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->IE,11)))
#define TSB_EPHC0_FLG_CMP0F                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,0)))
#define TSB_EPHC0_FLG_CMP1F                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,1)))
#define TSB_EPHC0_FLG_OVFF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,2)))
#define TSB_EPHC0_FLG_UDFF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,3)))
#define TSB_EPHC0_FLG_SB0F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,4)))
#define TSB_EPHC0_FLG_SB1F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,5)))
#define TSB_EPHC0_FLG_SB2F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,6)))
#define TSB_EPHC0_FLG_SB3F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,7)))
#define TSB_EPHC0_FLG_DIRF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,8)))
#define TSB_EPHC0_FLG_LWLMT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,9)))
#define TSB_EPHC0_FLG_UPLMT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->FLG,10)))
#define TSB_EPHC0_ARUN_RUN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->ARUN,0)))
#define TSB_EPHC0_ARUN_CLR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->ARUN,1)))
#define TSB_EPHC0_ADAT_PMF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0->ADAT,30)))
#define TSB_EPHC0_ADAT_PHCDIRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0->ADAT,31)))
#define TSB_EPHC0_BRUN_T24RUN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->BRUN,0)))
#define TSB_EPHC0_BDMA_DMADT0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->BDMA,0)))
#define TSB_EPHC0_BDMA_DMADT1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC0->BDMA,1)))
#define TSB_EPHC0_BCAP00_OVF00                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0->BCAP00,24)))
#define TSB_EPHC0_BCAP10_OVF10                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0->BCAP10,24)))
#define TSB_EPHC0_BCAP20_OVF20                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0->BCAP20,24)))
#define TSB_EPHC0_BCAP30_OVF30                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC0->BCAP30,24)))

#define TSB_EPHC1_EN_EN                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->EN,0)))
#define TSB_EPHC1_CNT_PBMOD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,10)))
#define TSB_EPHC1_CNT_PBDIR                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,11)))
#define TSB_EPHC1_CNT_MA12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,12)))
#define TSB_EPHC1_CNT_MA2DIR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,13)))
#define TSB_EPHC1_CNT_LWLMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,18)))
#define TSB_EPHC1_CNT_UPLMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,19)))
#define TSB_EPHC1_CNT_LOADLMT                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_EPHC1->CNT,20)))
#define TSB_EPHC1_IE_INTPCCP0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,0)))
#define TSB_EPHC1_IE_INTPCCP1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,1)))
#define TSB_EPHC1_IE_INTPCOVF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,2)))
#define TSB_EPHC1_IE_INTPCUDF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,3)))
#define TSB_EPHC1_IE_INTPCDT0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,4)))
#define TSB_EPHC1_IE_INTPCDT1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,5)))
#define TSB_EPHC1_IE_INTPCDT2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,6)))
#define TSB_EPHC1_IE_INTPCDT3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,7)))
#define TSB_EPHC1_IE_INTPCDIR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,8)))
#define TSB_EPHC1_IE_INTPCUOVF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,9)))
#define TSB_EPHC1_IE_INTLWLMT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,10)))
#define TSB_EPHC1_IE_INTUPLMT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->IE,11)))
#define TSB_EPHC1_FLG_CMP0F                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,0)))
#define TSB_EPHC1_FLG_CMP1F                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,1)))
#define TSB_EPHC1_FLG_OVFF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,2)))
#define TSB_EPHC1_FLG_UDFF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,3)))
#define TSB_EPHC1_FLG_SB0F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,4)))
#define TSB_EPHC1_FLG_SB1F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,5)))
#define TSB_EPHC1_FLG_SB2F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,6)))
#define TSB_EPHC1_FLG_SB3F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,7)))
#define TSB_EPHC1_FLG_DIRF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,8)))
#define TSB_EPHC1_FLG_LWLMT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,9)))
#define TSB_EPHC1_FLG_UPLMT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->FLG,10)))
#define TSB_EPHC1_ARUN_RUN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->ARUN,0)))
#define TSB_EPHC1_ARUN_CLR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->ARUN,1)))
#define TSB_EPHC1_ADAT_PMF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1->ADAT,30)))
#define TSB_EPHC1_ADAT_PHCDIRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1->ADAT,31)))
#define TSB_EPHC1_BRUN_T24RUN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->BRUN,0)))
#define TSB_EPHC1_BDMA_DMADT0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->BDMA,0)))
#define TSB_EPHC1_BDMA_DMADT1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC1->BDMA,1)))
#define TSB_EPHC1_BCAP00_OVF00                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1->BCAP00,24)))
#define TSB_EPHC1_BCAP10_OVF10                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1->BCAP10,24)))
#define TSB_EPHC1_BCAP20_OVF20                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1->BCAP20,24)))
#define TSB_EPHC1_BCAP30_OVF30                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC1->BCAP30,24)))

#define TSB_EPHC2_EN_EN                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->EN,0)))
#define TSB_EPHC2_CNT_PBMOD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,10)))
#define TSB_EPHC2_CNT_PBDIR                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,11)))
#define TSB_EPHC2_CNT_MA12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,12)))
#define TSB_EPHC2_CNT_MA2DIR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,13)))
#define TSB_EPHC2_CNT_LWLMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,18)))
#define TSB_EPHC2_CNT_UPLMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,19)))
#define TSB_EPHC2_CNT_LOADLMT                     (*((__O  uint32_t *)BITBAND_PERI(&TSB_EPHC2->CNT,20)))
#define TSB_EPHC2_IE_INTPCCP0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,0)))
#define TSB_EPHC2_IE_INTPCCP1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,1)))
#define TSB_EPHC2_IE_INTPCOVF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,2)))
#define TSB_EPHC2_IE_INTPCUDF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,3)))
#define TSB_EPHC2_IE_INTPCDT0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,4)))
#define TSB_EPHC2_IE_INTPCDT1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,5)))
#define TSB_EPHC2_IE_INTPCDT2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,6)))
#define TSB_EPHC2_IE_INTPCDT3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,7)))
#define TSB_EPHC2_IE_INTPCDIR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,8)))
#define TSB_EPHC2_IE_INTPCUOVF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,9)))
#define TSB_EPHC2_IE_INTLWLMT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,10)))
#define TSB_EPHC2_IE_INTUPLMT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->IE,11)))
#define TSB_EPHC2_FLG_CMP0F                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,0)))
#define TSB_EPHC2_FLG_CMP1F                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,1)))
#define TSB_EPHC2_FLG_OVFF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,2)))
#define TSB_EPHC2_FLG_UDFF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,3)))
#define TSB_EPHC2_FLG_SB0F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,4)))
#define TSB_EPHC2_FLG_SB1F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,5)))
#define TSB_EPHC2_FLG_SB2F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,6)))
#define TSB_EPHC2_FLG_SB3F                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,7)))
#define TSB_EPHC2_FLG_DIRF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,8)))
#define TSB_EPHC2_FLG_LWLMT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,9)))
#define TSB_EPHC2_FLG_UPLMT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->FLG,10)))
#define TSB_EPHC2_ARUN_RUN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->ARUN,0)))
#define TSB_EPHC2_ARUN_CLR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->ARUN,1)))
#define TSB_EPHC2_ADAT_PMF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2->ADAT,30)))
#define TSB_EPHC2_ADAT_PHCDIRF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2->ADAT,31)))
#define TSB_EPHC2_BRUN_T24RUN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->BRUN,0)))
#define TSB_EPHC2_BDMA_DMADT0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->BDMA,0)))
#define TSB_EPHC2_BDMA_DMADT1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EPHC2->BDMA,1)))
#define TSB_EPHC2_BCAP00_OVF00                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2->BCAP00,24)))
#define TSB_EPHC2_BCAP10_OVF10                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2->BCAP10,24)))
#define TSB_EPHC2_BCAP20_OVF20                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2->BCAP20,24)))
#define TSB_EPHC2_BCAP30_OVF30                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EPHC2->BCAP30,24)))

