MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM344FDXBG/mcu.h
/* Clock Generator (CG) */
#define TSB_CG_SYSCR_FPSEL0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,12)))
#define TSB_CG_SYSCR_FCSTOP0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,18)))
#define TSB_CG_SYSCR_FCSTOP1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,19)))
#define TSB_CG_SYSCR_FCSTOP2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,20)))
#define TSB_CG_SYSCR_PSCSTOP0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,21)))
#define TSB_CG_SYSCR_PSCSTOP1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,22)))
#define TSB_CG_SYSCR_PSCSTOP2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,23)))
#define TSB_CG_SYSCR_PSCSTOP3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,24)))
#define TSB_CG_OSCCR_WUEON                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,0)))
#define TSB_CG_OSCCR_WUEF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,1)))
#define TSB_CG_OSCCR_PLL0ON                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,2)))
#define TSB_CG_OSCCR_XEN1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,8)))
#define TSB_CG_OSCCR_PLL1ON                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,10)))
#define TSB_CG_OSCCR_XEN2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,16)))
#define TSB_CG_OSCCR_OSCSEL                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,17)))
#define TSB_CG_OSCCR_EHOSCSEL                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,18)))
#define TSB_CG_OSCCR_WUPSEL2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,19)))
#define TSB_CG_STBYCR_PTKEEP                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->STBYCR,17)))
#define TSB_CG_PLLSEL_PLL0SEL                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->PLLSEL,0)))
#define TSB_CG_PLLSEL_PLL1SEL                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->PLLSEL,16)))
#define TSB_CG_PWMGEAR_TMRDACLKEN                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->PWMGEAR,0)))
#define TSB_CG_PWMGEAR_TMRDBCLKEN                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->PWMGEAR,1)))
#define TSB_CG_FCLKMSKA_PORTA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,0)))
#define TSB_CG_FCLKMSKA_PORTB                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,1)))
#define TSB_CG_FCLKMSKA_PORTC                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,2)))
#define TSB_CG_FCLKMSKA_PORTD                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,3)))
#define TSB_CG_FCLKMSKA_PORTE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,4)))
#define TSB_CG_FCLKMSKA_PORTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,5)))
#define TSB_CG_FCLKMSKA_PORTG                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,6)))
#define TSB_CG_FCLKMSKA_PORTH                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,7)))
#define TSB_CG_FCLKMSKA_PORTJ                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,8)))
#define TSB_CG_FCLKMSKA_PORTK                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,9)))
#define TSB_CG_FCLKMSKA_PORTL                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,10)))
#define TSB_CG_FCLKMSKA_PORTM                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,11)))
#define TSB_CG_FCLKMSKA_PORTN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,12)))
#define TSB_CG_FCLKMSKA_DMACA                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,13)))
#define TSB_CG_FCLKMSKA_DMACB                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,14)))
#define TSB_CG_FCLKMSKA_DMACC                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,15)))
#define TSB_CG_FCLKMSKA_ADCA                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,16)))
#define TSB_CG_FCLKMSKA_ADCB                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,17)))
#define TSB_CG_FCLKMSKA_ADCC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,18)))
#define TSB_CG_FCLKMSKA_WDT                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,19)))
#define TSB_CG_FCLKMSKA_SIO_UART                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,20)))
#define TSB_CG_FCLKMSKA_I2C                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,21)))
#define TSB_CG_FCLKMSKA_EPHC0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,23)))
#define TSB_CG_FCLKMSKA_EPHC1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,24)))
#define TSB_CG_FCLKMSKA_EPHC2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCLKMSKA,25)))
#define TSB_CG_FCMSKA_TMRB0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,0)))
#define TSB_CG_FCMSKA_TMRB1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,1)))
#define TSB_CG_FCMSKA_TMRB2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,2)))
#define TSB_CG_FCMSKA_TMRB3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,3)))
#define TSB_CG_FCMSKA_TMRB4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,4)))
#define TSB_CG_FCMSKA_TMRB5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,5)))
#define TSB_CG_FCMSKA_TMRB6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,6)))
#define TSB_CG_FCMSKA_TMRB7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,7)))
#define TSB_CG_FCMSKA_TMRB8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,8)))
#define TSB_CG_FCMSKA_TMRB9                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,9)))
#define TSB_CG_FCMSKA_TMRBA                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,10)))
#define TSB_CG_FCMSKA_TMRBB                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,11)))
#define TSB_CG_FCMSKA_TMRBC                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,12)))
#define TSB_CG_FCMSKA_TMRBD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,13)))
#define TSB_CG_FCMSKA_TMRBE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,14)))
#define TSB_CG_FCMSKA_TMRBF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,15)))
#define TSB_CG_FCMSKA_TSPI0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,16)))
#define TSB_CG_FCMSKA_TSPI1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,17)))
#define TSB_CG_FCMSKA_TSPI2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,18)))
#define TSB_CG_FCMSKA_TSPI3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,19)))
#define TSB_CG_FCMSKA_TSPI4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,20)))
#define TSB_CG_FCMSKA_EPHC0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,21)))
#define TSB_CG_FCMSKA_EPHC1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,22)))
#define TSB_CG_FCMSKA_EPHC2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,23)))
#define TSB_CG_FCMSKA_FUART                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FCMSKA,24)))
#define TSB_CG_IMCGA_INT00EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,0)))
#define TSB_CG_IMCGA_INT01EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,8)))
#define TSB_CG_IMCGA_INT02EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,16)))
#define TSB_CG_IMCGA_INT03EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,24)))
#define TSB_CG_IMCGB_INT04EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB,0)))
#define TSB_CG_IMCGB_INT05EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB,8)))
#define TSB_CG_IMCGB_INT06EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB,16)))
#define TSB_CG_IMCGB_INT07EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB,24)))
#define TSB_CG_IMCGC_INT08EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGC,0)))
#define TSB_CG_IMCGC_INT09EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGC,8)))
#define TSB_CG_IMCGC_INT0AEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGC,16)))
#define TSB_CG_IMCGC_INT0BEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGC,24)))
#define TSB_CG_IMCGD_INT0CEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGD,0)))
#define TSB_CG_IMCGD_INT0DEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGD,8)))
#define TSB_CG_IMCGD_INT0EEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGD,16)))
#define TSB_CG_IMCGD_INT0FEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGD,24)))
#define TSB_CG_RSTFLG_PINRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,0)))
#define TSB_CG_RSTFLG_OSCFLF                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,1)))
#define TSB_CG_RSTFLG_WDTRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,2)))
#define TSB_CG_RSTFLG_BUPRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,3)))
#define TSB_CG_RSTFLG_SYSRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,4)))

/** @} */ /* End of group Device_Peripheral_registers */

#ifdef __cplusplus
}
#endif

#endif  /* __TMPM344_H__ */

/** @} */ /* End of group TMPM344 */
/** @} */ /* End of group TOSHIBA_TX03_MICROCONTROLLER */
